package One;

/* Амиго очень умный
Написать программу, выводящую на экран надпись «Амиго очень умный».
Пример вывода на экран:
Амиго очень умный
*/
public class Four {
    public static void main(String[] args)
    {
        System.out.println("Амиго очень умный");
    }
}
